# Brewfile for cluster-ops development environment

# Core development tools
brew "bash"
brew "curl"
brew "git"
brew "gh"
brew "gum"
brew "wget"
brew "just"
brew "worktrunk"
brew "doppler"
cask "claude"
cask "docker-desktop"
brew "python@3.13"
brew "opentofu"
brew "hashicorp/tap/vault"

# Code quality and formatting
brew "gitleaks"                 # Find git secrets
brew "lefthook"                 # Git hooks framework
brew "markdownlint-cli"         # Markdown linter
brew "shellcheck"               # Shell script linter
brew "taplo"                    # TOML formatter
brew "tflint"                   # Terraform linter
brew "yamlfmt"                  # YAML formatter
brew "yamllint"                 # YAML linter

# Language servers (for editor integration)
brew "bash-language-server"    # Bash language server
brew "docker-ls"               # Docker language server
brew "helm-ls"                 # Helm language server
brew "tofu-ls"                 # OpenTofu language server
brew "yaml-language-server"    # YAML language server
